app/views/banks/show.html.erb

SELECT  1 AS one FROM "bank_subsidiaries" WHERE "bank_subsidiaries"."bank_id" = ? LIMIT ?  [["bank_id", 1], ["LIMIT", 1]]
SELECT "bank_subsidiaries".* FROM "bank_subsidiaries" WHERE "bank_subsidiaries"."bank_id" = ?  [["bank_id", 1]]
---
<h2>Sucursales</h2>
<% if @bank.bank_subsidiaries.any? %>