app/controllers/banks_controller.rb

SELECT "banks".* FROM "banks"
---
  def index
    @banks = Bank.all

DELETE FROM "banks" WHERE "banks"."id" = ?  [["id", 2]]
---
  def destroy
    @bank.destroy

SELECT  "banks".* FROM "banks" WHERE "banks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_bank
      @bank = Bank.find(params[:id])